# Напишите программу: 
# а) для добавления элемента в кортеж; 
# б) для печати кортежа со строковым форматированием. Например, задан кортеж: (100, 200, 300), на экран вывести: это кортеж (100, 200, 300).

# а) Добавление элемента в кортеж - невозможно, так как кортежи неизменяемы

# б) Печать кортежа со строковым форматированием
tuple_data = (100, 200, 300)
print("Это кортеж", tuple_data)
