# Напишите программу:
#  а) для создания кортежа; 
#  б) для преобразования кортежа в словарь.


# а) Создание кортежа
tuple_data = (1, 2, 3, 4, 5)

# б) Преобразование кортежа в словарь
dict_data = {}
for i, value in enumerate(tuple_data):
    dict_data[f"key_{i+1}"] = value

print("Созданный кортеж:", tuple_data)
print("Преобразованный в словарь:", dict_data)
